[
  {
    "title": "Project Earth - Full Stack App",
    "alt": "Project Earth",
    "description": "This app is about social responsibility for the environment.  You can view challenges added by other people. If signed up/logged in, you can create a challenge for yourself and other to make incremental lifestyle changes to have a better realtionship with the Earth.",
    "image": "/images/projectEarth.png",
    "website": "https://projectearthecochallenge.herokuapp.com/",
    "github": "https://github.com/lauragupta/projectEarth",
    "technology": "React, JavaScript, SASS, CSS, MongoDB, Mongoose, React Router, Express, JWT, bcrypt, dotenv, Bootstrap, Heroku",
    "softskill": "GRIT!!!, Persistance, Independently Learning New Technologies, Website Planning, Speaking and Presenting, "
  },
  {
    "title": "React Portfolio - React App",
    "alt": "React Portfolio",
    "description": "This app is my portfolio, but remade for me to practice using react. I used some Bootstrap elements and then modified them with CSS. Don't forget to take a look at my resume.",
    "image": "/images/reactPortfolio.png",
    "website": "https://lauragupta.github.io/lauraReactPortfolio/",
    "github": "https://github.com/lauragupta/lauraReactPortfolio",
    "technology": "React, React App, JavaScript, CSS, Express, and Bootstrap",
    "softskill": " Website Planning"
  },
  {
    "title": "Tech Blog - Full Stack App",
    "description": "This project is a blog viewing and writing platform. Users can log into the site to comment on blogs, contribute a technical blog posts, or edit or delete a blog they have written. Without logging into the site, blogs can be read. This project is a full stack application using Model-View-Controller (MVC).",
    "image": "/images/techBlogger.png",
    "website": "https://iamatechbloggernow.herokuapp.com/",
    "github": "https://github.com/lauragupta/IAmATechBloggerNow",
    "technology": "Handlebars, SQL, Sequelize, Express, Heroku and several NPM Node Modules",
    "softskill": "Persistance, Determination, Troubleshooting"
  },
  {
    "title": "Get Moving - Full Stack App",
    "description": "This app is a social exercise activity app, where users can view activities added by other people. If signed up and logged in, you can create and event or delete an event you created, as well as register to events. There is also a fun background color-changer at the bottom of each page.",
    "image": "/images/getMoving.png",
    "website": "https://pacific-wildwood-76799.herokuapp.com/",
    "github": "https://github.com/lauragupta/get-moving",
    "technology": "JavaScript, Express, Handlebars, MySQL, Sequelize, Simonwep/pickr, bcrypt, dotenv, connect-session-sequelize, Express-handlebars, Express-session, Google Slides",
    "softskill": "Teamwork, Communication,  Learning New Technologies, Website Planning, Speaking and Presenting, "
  },
  {
    "title": "Shopping App - Back End",
    "description": "This project uses Object-Relational Mapping (ORM) to manage a database including getting (get), adding (post), editing (put), and deleting(delete). Because this is a back-end project, it does not have a live site, but you can check out my walkthrough video instead.",
    "image": "/images/backEndShopping.png",
    "website": "https://watch.screencastify.com/v/VuxVse1urVrip6wRB6hG",
    "github": "https://github.com/lauragupta/backEndShoppingECommerce",
    "technology": "JavaScript, MySQL, Sequelize, Insomnia, Express, Mysql2 NPM, Screencastify",
    "softskill": "Creating and narrating a walkthough video"
  },
  {
    "title": "Note Taker - Back End",
    "description": "This is a live server project where you can enter a note title and note text that you can then save it. The note title will populate on the list at the left-hand side.",
    "image": "/images/noteTaker.png",
    "website": "http://fierce-eyrie-06541.herokuapp.com/",
    "github": "https://github.com/lauragupta/noteTaker",
    "technology": "JavaScript, Express, Heroku",
    "softskill": "Persistance, Asking for help, Asking good questions"
  },
  {
    "title": "Feed Me - Front End",
    "description": "If you can't decide where to eat, this restaurant finder site randomly shows a nearby restaurant after the user inputs city name, cost preference, and type of restaurant.",
    "image": "/images/FeedMe.png",
    "website": "https://pentazoned.github.io/feed-me/",
    "github": "https://github.com/lauragupta/feed-me",
    "technology": "HTML, CSS, Bulma CSS Framework",
    "softskill": "Site planning, Teamwork, Independently learning new technology"
  }
]